frontend/controllers/CasesController.php

          protected function getOc1Outbound ($channel) {
            if ($channel==1)
                $inbound=0;
            else
                 $inbound=1;
            $query = new Query;
            $query->select('id, name')
            ->from('outcome_code1')
            ->where('deleted = 0 and inbound = '.$inbound)
            ->orderBy('name');
            $rows = $query->all();
---
SELECT `id`, `name` FROM `outcome_code1` WHERE deleted = 0 and inbound = 1 ORDER BY `name`

        protected function getOc2 ($oc1) {
            $query = new Query;
            $query->select('id, name')
            ->from('outcome_code2')
            ->where('deleted = 0 and outcome_code1_id = '.$oc1)
            ->orderBy('name');
            $rows = $query->all();
---
SELECT `id`, `name` FROM `outcome_code2` WHERE deleted = 0 and outcome_code1_id = 46 ORDER BY `name`

        protected function getOc3 ($oc2) {
            $query = new Query;
            $query->select('id, name')
            ->from('outcome_code3')
            ->where('deleted = 0 and outcome_code2_id = '.$oc2)
            ->orderBy('name');
            $rows = $query->all();
---
SELECT `id`, `name` FROM `outcome_code3` WHERE deleted = 0 and outcome_code2_id = 82 ORDER BY `name`